# Titanic Passenger Survival Predition
### by Anqi Xue  
  
Kaggle Challenge Link: https://www.kaggle.com/competitions/titanic/data  
The Goal is to predict if a passenger survived the sinking of the Titanic or not.

# Part 0: Environment Setup

In [1]:
# Import numpy, pandas, matplotlib.pyplot and seaborn with our usual aliases.
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

# Set the seaborn style to darkgrid
sns.set_style('darkgrid')

# Execute the matplotlib magic function to display plots inline
%matplotlib inline

# Part 1: Data Cleaning and Feature Selection

## 1.1 Data Preparation

This dataset contains details of the Titanic passenger information and the target variable is a binary variable indicating the survival (0 = No, 1 = Yes) of a passenger.

In [2]:
# Load the train dataset and test dataset

train_df = pd.read_csv('data/train.csv')
test_df = pd.read_csv('data/test.csv')

In [3]:
train_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

In [4]:
test_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB

In [5]:
# Set PassengerId as the Index

train_df = train_df.set_index('PassengerId')
test_df = test_df.set_index('PassengerId')

In [6]:
train_df.head()

,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,,
1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [7]:
test_df.head()

,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
PassengerId,,,,,,,,,,
892,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
893,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S
894,2,"Myles, Mr. Thomas Francis",male,62.0,0,0,240276,9.6875,NaN,Q
895,3,"Wirz, Mr. Albert",male,27.0,0,0,315154,8.6625,NaN,S
896,3,"Hirvonen, Mrs. Alexander (Helga E Lindqvist)",female,22.0,1,1,3101298,12.2875,NaN,S

## 1.2 Data Exploration and Transformation

**Drop Irrelevant Columns**  
Drop the 'Name', 'Ticket', 'Cabin' columns because their information are irrelevant to the target output

In [8]:
train_df = train_df.drop(columns = ['Name', 'Ticket', 'Cabin'])
test_df = test_df.drop(columns = ['Name', 'Ticket', 'Cabin'])

**Missing Values**  
From the df.info() we can see that there are missing values in the columns 'Age', 'Cabin', 'Embarked' for the train set and missing values in the columns 'Age', 'Fare', 'Cabin' fot the test set. ('Cabin' has already been dropped)

In [9]:
# Deal with missing vlaue in train_df

# Fill the missing values of Age with the median value of Age
train_df.Age = train_df.Age.fillna(train_df.Age.median())

# Fill the missing values of Embarked with the string 'MISSING'
train_df.Embarked = train_df.Embarked.fillna('MISSING')

In [10]:
# Deal with missing vlaue in test_df

# Fill the missing values of Age with the median value of Age
test_df.Age = test_df.Age.fillna(test_df.Age.median())

# Fill the missing values of Fare with the median value of Fare
test_df.Fare = test_df.Fare.fillna(test_df.Fare.median())

In [11]:
train_df

             Survived  Pclass     Sex   Age  SibSp  Parch     Fare Embarked
PassengerId
1                   0       3    male  22.0      1      0   7.2500        S
2                   1       1  female  38.0      1      0  71.2833        C
3                   1       3  female  26.0      0      0   7.9250        S
4                   1       1  female  35.0      1      0  53.1000        S
5                   0       3    male  35.0      0      0   8.0500        S
...               ...     ...     ...   ...    ...    ...      ...      ...
887                 0       2    male  27.0      0      0  13.0000        S
888                 1       1  female  19.0      0      0  30.0000        S
889                 0       3  female  28.0      1      2  23.4500        S
890                 1       1    male  26.0      0      0  30.0000        C
891                 0       3    male  32.0      0      0   7.7500        Q

[891 rows x 8 columns]

In [12]:
test_df

             Pclass     Sex   Age  SibSp  Parch      Fare Embarked
PassengerId
892               3    male  34.5      0      0    7.8292        Q
893               3  female  47.0      1      0    7.0000        S
894               2    male  62.0      0      0    9.6875        Q
895               3    male  27.0      0      0    8.6625        S
896               3  female  22.0      1      1   12.2875        S
...             ...     ...   ...    ...    ...       ...      ...
1305              3    male  27.0      0      0    8.0500        S
1306              1  female  39.0      0      0  108.9000        C
1307              3    male  38.5      0      0    7.2500        S
1308              3    male  27.0      0      0    8.0500        S
1309              3    male  27.0      1      1   22.3583        C

[418 rows x 7 columns]